Autodesk.Revit.DB.ConnectorProfileType
An enumerated type listing all connector profile types

Autodesk.Revit.DB.ConnectorProfileType.Oval
Oval connector profile

Autodesk.Revit.DB.ConnectorProfileType.Rectangular
Rectangular connector profile

Autodesk.Revit.DB.ConnectorProfileType.Round
Round connector profile

Autodesk.Revit.DB.ConnectorProfileType.Invalid
Invalid connector profile